-- заполняем таблицу artist
INSERT INTO artist(name)
VALUES 
	('КиШ'), 
	('Кино'), 
	('Пикник'), 
	('Ария'), 
	('Максим'),
	('Руки вверх'),
	('Антонио Вивальди'), 
	('Пётр Чайковский'),
	('Etolie Vipe')
;


-- заполняем таблицу genre (жанры)
INSERT INTO genre(title)
VALUES 
	('Рок'), 
	('Поп'), 
	('Классика')
;


-- заполняем таблицу album
INSERT INTO album(title, year)
VALUES 
	('Для души', 2018), 
	('Танцульки', 2019), 
	('Радость ушам', 2020),
	('Сборник хитов', 2016)
;


-- заполняем таблицу track
INSERT INTO track (album_id, title, duration)
VALUES 
	(5, 'Лесник', 191),
	(5, 'Кукла колдуна', 203), 
	(5, 'Сапоги мертвеца', 149),
	(5, 'Мой характер', 231),
	(5, 'Стук', 229),
	(5, 'Группа крови', 284),
	(5, 'Хочу перемен', 292),
	(5, 'В наших глазах', 214),
	(5, 'Сияние', 310),
	(5, 'Там, на самом краю земли', 131),
	(5, 'Египтянин', 308),
	(5, 'Улица Роз', 356),
	(5, 'Штиль', 335),
	(6, 'Знаешь ли ты', 242),
	(6, 'Сон', 221),
	(6, 'Танцуй', 221),
	(6, 'Студент', 231),
	(6, 'The Summer Is Mine', 171),
	(7, 'Storm', 163),
	(7, 'Лебединое озеро', 197),
	(8, 'Сияние', 310),
	(8, 'Сапоги мертвеца', 149),
	(8, 'Танцуй', 221),
	(8, 'Storm', 163),
	(8, 'В наших глазах', 214)
;


-- заполняем таблицу artistalbum
INSERT INTO artistalbum(artist_id, album_id)
VALUES 
	(29, 5), 
	(30, 5), 
	(31, 5),
	(32, 5),
	(33, 6),
	(34, 6),
	(35, 6),
	(36, 7),
	(37, 7),
	(29, 8),
	(33, 8),
	(36, 8),
	(30, 8),
	(32, 8),
	(34, 8)
;


-- заполняем таблицу artistgenre
INSERT INTO artistgenre(genre_id, artist_id)
VALUES 
	(4, 29), 
	(4, 30), 
	(4, 31),
	(4, 32),
	(5, 33),
	(5, 34),
	(6, 35),
	(6, 36),
	(5, 37)
;


-- заполняем таблицу collection
INSERT INTO collection(title, year)
VALUES 
	('Русский рок', 2020), 
	('Тряси телом', 2018), 
	('Шедевры классики', 2019),
	('Сборная салянка', 2022)
;


-- заполняем таблицу collectiontrack
INSERT INTO collectiontrack(collection_id,track_id)
VALUES 
	(7, 85), 
	(7, 86), 
	(7, 87),
	(7, 88),
	(7, 89),
	(7, 90),
	(7, 91),
	(7, 92),
	(7, 93),
	(7, 94),
	(7, 95),
	(7, 96),
	(7, 97),
	(8, 98),
	(8, 99),
	(8, 100),
	(8, 101),
	(8, 102),
	(9, 103),
	(9, 104),
	(10, 86),
	(10, 88),
	(10, 98),
	(10, 95),
	(10, 103)
;


-- проверим результат в окне вывода
select * from artist;
select * from genre;
select * from album;
select * from track;
select * from artistalbum;
select * from artistgenre;
select * from collection;
select * from collectiontrack;